## Dealing with missing data

In the real world, data is rarely clean: it often has missing parts of the data for all sorts of reasons: it was mis-typed, lost during file format conversion, or was just not available at the collection time. Before such a dataset can be analysed, one needs to "clean" it - for example, delete entries with missing values completely, or fill the missing values with an average for the dataset.

Let's create a dataframe with some values missing.

In [1]:
import pandas as pd
import numpy as np

In [2]:
# create a dataframe with missing data
population  = {'California': 38332521,
                   'Texas': None,
                   'New York': 19651127,
                   'Florida': None,
                   'Illinois': 12882135}
area = {'California': 423967,
                   'Texas': 695662,
                   'New York': 141297,
                   'Florida': 170312,
                   'Illinois': 149995}
df = pd.DataFrame({'pop': population, 'area': area})
df

                   pop    area
California  38332521.0  423967
Texas              NaN  695662
New York    19651127.0  141297
Florida            NaN  170312
Illinois    12882135.0  149995

In this dataframe, the population values for Florida and Texas are missing. One can check if a column has any values missing, using the `isnull` method of the Series:

In [3]:
df['pop'].isnull()

California    False
Texas          True
New York      False
Florida        True
Illinois      False
Name: pop, dtype: bool

A usual way to deal with missing values is to drop those rows which contain a NaN value. This can be done by calling `dropna`. Set the `inplace` argument to `True` to change the dataframe in-place.

In [4]:
df.dropna(inplace=True)

In [5]:
df

                   pop    area
California  38332521.0  423967
New York    19651127.0  141297
Illinois    12882135.0  149995

The rows for Florida and Texas have been removed.

Another way to deal with missing values is to drop columns that contain a missing value. We just need to specify the `axis` argument of `dropna` to be 1, indicating that we are dropping columns.

In [6]:
# re-create the dataframe with missing values
population  = {'California': 38332521,
                   'Texas': None,
                   'New York': 19651127,
                   'Florida': 19552860,
                   'Illinois': 12882135}
area = {'California': 423967,
                   'Texas': 695662,
                   'New York': 141297,
                   'Florida': 170312,
                   'Illinois': 149995}
df = pd.DataFrame({'pop': population, 'area': area})

In [7]:
df.dropna(inplace=True, axis="columns")
df

              area
California  423967
Texas       695662
New York    141297
Florida     170312
Illinois    149995

Now, the `pop` column has been removed.

## Missing data in a time series

In time series, missing data can be filled by **forward-filling** (inserting the value of the previous available observation instead of the missing one), **back-filling** (inserting the value of the next available observation instead of the missing one) or with **interpolated** values. Consider the following example:

In [8]:
data = {
    '2018-01-01': 5,
    '2018-01-02': None,
    '2018-01-03': 7,
    '2018-01-04': 8,
    '2018-01-05': None,
    '2018-01-06': 6
}
df = pd.DataFrame({'ts': data})
df

             ts
2018-01-01  5.0
2018-01-02  NaN
2018-01-03  7.0
2018-01-04  8.0
2018-01-05  NaN
2018-01-06  6.0

Forward-filling inserts the previous day's value:

In [9]:
df.fillna(method='ffill')

             ts
2018-01-01  5.0
2018-01-02  5.0
2018-01-03  7.0
2018-01-04  8.0
2018-01-05  8.0
2018-01-06  6.0

Back-filling inserts the next day's value:

In [10]:
df.fillna(method='bfill')

             ts
2018-01-01  5.0
2018-01-02  7.0
2018-01-03  7.0
2018-01-04  8.0
2018-01-05  6.0
2018-01-06  6.0

Instead of missing values, interpolated values can be used, that is, the means of neighboring available are inserted in the cells with missing values. This is achieved with the following idiom:

In [11]:
df.interpolate(method="linear", axis=0)

             ts
2018-01-01  5.0
2018-01-02  6.0
2018-01-03  7.0
2018-01-04  8.0
2018-01-05  7.0
2018-01-06  6.0

## Removing duplicates

Another common problem with data from "the wild" is duplicated observations. Such duplicates can appear in a dataset, for example, as a result of merging several smaller datasets that have some overlapping entries.

To remove duplicates, one can use the `drop_duplicates` method:

In [12]:
# a dataframe with duplicated rows (the first and the second rows are identical)
df = pd.DataFrame({'col1': ['a', 'a', 'a'], 'col2': [1, 1, 2]})
df

  col1  col2
0    a     1
1    a     1
2    a     2

In [13]:
# note the `inplace` argument
df.drop_duplicates(inplace=True)